{"config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "dropout": 0.0, "return_sequences": false, "bias_regularizer": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 200, 102], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "unroll": false, "bias_constraint": null, "activity_regularizer": null, "name": "lstm_1", "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "units": 128, "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 200}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "kernel_regularizer": null, "return_sequences": true, "bias_regularizer": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "name": "lstm_2", "dropout": 0.0, "implementation": 0, "recurrent_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "units": 128, "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "units": 102, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.4"}